target/test-classes/xml/sws/TC32533_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:maintainBundleRequest>
      <sel:maintainBundleAction effective="NEXTBILLDATE" acceptWarning="false">
        <sel:externalSystemId>NETCALL</sel:externalSystemId>
        <sel:accountNumber>23323</sel:accountNumber>
        <sel:subscriptionNumber>23233</sel:subscriptionNumber>
        <sel:bundleActions>
          <!--1 or more repetitions:-->
          <sel:bundleAction actionType="REMOVE">
            <sel:group>FAMILYPERK</sel:group>
            <sel:groupCode>FAMILYPERK-FC</sel:groupCode>
            <sel:bundleCode>250MB-FDATA-0-FC</sel:bundleCode>
            <sel:billCapNotifications>OFF</sel:billCapNotifications>
          </sel:bundleAction>
          <sel:bundleAction actionType="ADD">
            <sel:group>FAMILYPERK</sel:group>
            <sel:groupCode>FAMILYPERK-FC</sel:groupCode>
            <sel:bundleCode>500MB-FDATA-0-FC-4G</sel:bundleCode>
            <sel:billCapNotifications>OFF</sel:billCapNotifications>
          </sel:bundleAction>
        </sel:bundleActions>
      </sel:maintainBundleAction>
    </sel:maintainBundleRequest>
  </soapenv:Body>
</soapenv:Envelope>
